app/views/participants/components/_left_side_bar.html.haml

SELECT "behaviours".* FROM "behaviours" ORDER BY "behaviours"."id" ASC
---
      %ul
        - Behaviour.all.order(:id).each do |behaviour|