app/views/participants/components/_right_side_bar.html.haml

      %li.green Activities Summary
      - Behaviour.all.each do |behaviour|
---
SELECT "behaviours".* FROM "behaviours"