app/views/participants/_form.html.haml

SELECT "behaviours".* FROM "behaviours"
---
        %b.common-font-color.score_lbl_margin_left Level
      - Behaviour.all.each do |behaviour|