app/controllers/participant/activities_controller.rb

  def index
    respond_to do |format|
      if params[:page] && !params[:behaviour_id].present?
        @activities = Activity.page(params[:page]).per(Settings.participants.pagination.per_page).order('title ASC')
        format.js{
        render file: 'participant/activities/index'
      }
      elsif params[:behaviour_id]
        if params[:behaviour_id].present?
          @activities = Activity.find_activities_by_behaviour_id(split_params_for_filter(params[:behaviour_id])).page(params[:page]).per(Settings.participants.pagination.per_page)
---
SELECT "activities"."id" FROM "activities" WHERE "activities"."behaviour_id" = $1  [["behaviour_id", 1]]