app/controllers/participant/activities_controller.rb

  def index
    respond_to do |format|
      if current_participant.cohort.present?
---
SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 1]]