app/controllers/participant/home_controller.rb

  def find_participant_from_params
    @participant = Participant.find(params[:id])
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = 1 ORDER BY "participants"."id" ASC LIMIT 1