app/controllers/cohorts_controller.rb

INSERT INTO "cohorts" ("cohort_type", "created_at", "name", "updated_at", "year_started") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cohort_type", 1], ["created_at", Thu, 04 Jun 2015 09:20:42 UTC +00:00], ["name", "first_cohort"], ["updated_at", Thu, 04 Jun 2015 09:20:42 UTC +00:00], ["year_started", 2018]]
---
	def create
		@cohort = Cohort.create(cohort_params)

SELECT "cohorts".* FROM "cohorts"
---
	def index
		@cohorts = Cohort.all

SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = 1 LIMIT 1
---
  def find_cohort
    @cohort = Cohort.find_by_id(params[:id])