app/controllers/participants_controller.rb

  def create
    @participant = Participant.new(participant_params)
    if @participant.save
---
INSERT INTO "participants" ("cohort_id", "created_at", "division", "email", "first_name", "job_title", "last_name", "performance_summary", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at", "year_started") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def set_cohort
    @cohorts = Cohort.all
---
SELECT "cohorts".* FROM "cohorts"